---
layout: default
title: Линейность:: tmn, ttt
---

Список задач, в которых используется понятие линейности.

*Задача 1. (101 корова)* В стаде 101 корова. Известно, что если убрать любую из коров, то оставшихся можно разделить на две группы по 50 коров с одинаковой суммарной массой в каждой из групп. Докажите, что все веса коров одинаковые.

*Задача 2.* Прямоугольник разбит на квадраты. Докажите, что отношение сторон прямоугольника рационально.

*Задача 3.* Прямоугольник разбит на прямоугольники. У каждого прямоугольника разбиения по крайней мере одна сторона имеет целую длину. Докажите, что и у исходного прямоугольника хотя бы одна сторона имеет целую длину.

*Задача 4.* Можно ли квадрат разрезать на нечетное число равновеликих (по площади) треугольников?

*Задача 5.* Есть набор лампочек и набор переключателей. Каждая лампочка имеет два состояние: включена и выключена. Каждый выключатель подведен к определенному набору лампочек (для каждого выключателя такой набор свой) и при нажатии на него меняет состояние этих лампочек. Изначально все лампочки выключены. 

*Задача 6.* (TODO: про линейные рекуретные последовательности)

*Задача 7.* (TODO: алгебраические числа, их сумма и произведение)

*Задача 8.* На отрезке [0;1] отмечено несколько различных точек. При этом каждая отмеченная точка расположена либо ровно посередине между двумя другими отмеченными точками (не обязательно соседними с ней), либо ровно посередине между отмеченной точкой и концом отрезка. Докажите, что все отмеченные точки рациональны. (ММО 1998.9.6)

*Задача 9.* Рассмотрим граф без петель и двойных ребер. Каждая вершина раскрашена в белый или черный цвет. *Переключением* вершины называется операция, меняющая цвет самой вершины и всех смежных вершин. Вначале все вершины были белые. Докажите, что можно выполнить несколько переключений так, что все вершины станут черными.
